app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Porridge beans"], ["measurement_unit", "1"], ["price", 2000], ["quantity", 30], ["user_id", 1], ["created_at", "2022-12-23 18:01:07.036346"], ["updated_at", "2022-12-23 18:01:07.036346"]]
---
  def create
    food = current_user.foods.new(food_params)

    if food.save

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" IN ($1, $2)  [["id", 1], ["id", 6]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
  def general
    @foods = current_user.foods
    current_user.recipes.map do |recipe|
      recipe.recipe_foods.includes(:food).map do |recipe_food|
        food = recipe_food.food
        test = @foods.select { |f| f.name == food.name }[0]
        test.quantity = test.quantity - recipe_food.quantity
      end
    end
    @foods = @foods.select { |f| f.quantity.negative? }