app/controllers/recipe_foods_controller.rb

  def new
    recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @recipe = Recipe.find(params[:recipe_id])
    recipe_food = RecipeFood.new(recipe_food_params)
    recipe_food.recipe = @recipe

    if recipe_food.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 20], ["recipe_id", 2], ["food_id", 1], ["created_at", "2022-12-24 04:10:07.811808"], ["updated_at", "2022-12-24 04:10:07.811808"]]

  def destroy
    recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]